Repository: sillsdev/FwLocalizations
Catalog: messages.ms.tmx
Source language: en
Languages: ms

source: The two entries have been merged.
ms: Dua entri ini telah dicantumkan.

source: The underlying text for this chart appears to have changed. The program has attempted to repair things, but you may just need to start over.
ms: Teks dasar bagi carta ini telah diubah. Program cuba membaiki, tetapi anda perlu mula semula.

source: The updated mapping file <{0}> has been saved.
ms: Fail pemetaan <{0}> yang telah dikemaskini telah disimpan.

source: The values stored in this dialog box control the parsers.
ms: Nilai-nilai tersimpan dalam kotak dialog ini mengawal penghurai-penghurai kata.

source: The variant abbreviation "{0}" is reserved for "{1}", so it cannot be used here.
ms: Singkatan varian "{0}" tersimpan bagi "{1}", jadi ia tidak dapat digunakan di sini.

source: The variant abbreviation "{0}" was associated with "{1}". Do you want to change "{0}" to refer to "{2}"?
ms: Singkatan varian "{0}" diiringi dengan "{1}". Adakah anda mahu mengubah "{0}" untuk merujuk "{2}"?

source: The variant abbreviation is invalid. It must consist of alphanumeric characters, possibly with hyphens separating subsections.
ms: Singkatan varian adalah tidak sah. Ia mestilah terdiri daripada aksara angka abjad, kemungkinan dengan sempang yang memisahkan subbahagian.

source: The variant abbreviation you entered is already in use.
ms: Singkatan varian yang anda masukkan sudah digunakan.

source: The variant name "{0}" is already associated with "{1}", so it cannot be used here.
ms: Nama varian "{0}" sudah berhubungan dengan "{1}", jadi ia tidak boleh digunakan di sini.

source: The word or phrase is too long so the interlinearized wordform has been truncated to the maximum length. Try using the Tools/Guess Word Breaks tool on the baseline text, or insert word breaks into the text manually.
ms: Perkataan atau frasa adalah terlalu panjang, jadi bentuk yang telah diantarabariskan telah dipintaskan ke kepanjangan yang paling maksimum. Cuba gunakan Alat/alat Teka Uraian Perkataan pada teks asas, atau selitkan uraian perkataan ke dalam teks secara manual.

source: The writing system {0} and all text in the writing system will be deleted permanently. Are you sure you wish to delete the writing system?
ms: Sistem penulisan {0} dan semua teks dalam sistem penulisan akan dihapus selamanya. Adakah anda pasti hendak menghapus sistem penulisan itu?

source: The writing system and all text in the writing system will be deleted permanently. Are you sure you wish to delete the writing system?
ms: Sistem penulisan dan semua teks dalam sistem penulisan akan dihapus selamanya. Adakah anda pasti hendak menghapus sistem penulisan itu?

source: The writing system could not be installed. There is a problem in your language definition. See the FieldWorks ReadMe for help in this area.
ms: Sistem penulisan tidak dapat dipasang. Terdapat masalah dalam definisi bahasa anda. Lihat FieldWorks ReadMe untuk bantuan dalam masalah ini.

source: The writing system could not be modified. There is a problem in your language definition. See the FieldWorks ReadMe for help in this area.
ms: Sistem penulisan tidak dapat diubahsuai. Terdapat masalah dalam definisi bahasa anda. Lihat FieldWorks ReadMe untuk bantuan dalam masalah ini.

source: The writing sytem codes you entered include the code {0} twice. This is not allowed.
ms: Kod-kod sistem penulisan yang anda masukkan memasukkan kod tersebut {0} dua kali. Ini tidak dibenarkan.

source: The XML file {0} is invalid. This is a programming error. Please report this to the FieldWorks team.
ms: Fail XML {0} adalah tidak sah. Ini adalah ralat pemprograman. Sila laporkan ke pasukan FieldWorks.

source: The XML is not well-formed; you need to correct it and try again.
ms: XML ini tidak terbentuk rapi; Anda harus membetulkannya dan cuba semula.

source: The zip file does not appear to contain a FieldWorks backup. Did you remember to make a backup that includes an XML version of the data?
ms: Fail zip kelihatan tidak mengandungi backup FieldWorks. Adakah anda ingat untuk membuat backup yang mengandungi versi XML data tersebut?

source: The zip file does not contain a version 6.0 (or earlier) FieldWorks backup.
ms: Fail zip tidak mengandungi backup FieldWorks versi 6.0 (atau yang sebelumnya).

source: There are duplicate {0} fields named "{1}". Please choose a different name.
ms: Terdapat lebih daripada satu bidang {0} yang bernama "{1}". Sila pilih nama lain.

source: There is a missing opening square bracket '[' somewhere around here: '{0}'.
ms: Terdapat kehilangan ketika membuka kurung siku '[' di sekitar sini: '{0}'.

source: There is a problem with this environment string '{0}':
ms: Terdapat masalah dengan rentetan sekitaran '{0}' ini:

source: There is already a field named {1} in each {0}, please choose a different name for your Custom field.
ms: Nama bidang {1} sudah ada dalam setiap {0}, sila pilih nama lain bagi bidang Khas anda.

source: There is already a project with the same name as the one you are trying to convert.
ms: Sudah ada projek yang sama nama dengan projek yang anda sedang cuba tukarkan.

source: There is some kind of error somewhere around here: '{0}'. It may be a missing underscore _, two or more underscores, a missing slash /, something beyond a word boundary symbol #, or two or more word boundary symbols at the same edge.
ms: Terdapat beberapa jenis ralat di sekitar sini: '{0}'. Mungkin hilang satu underscore _, dua underscore atau lebih, satu garis condong / yang hilang, sesuatu yang melampaui simbol batasan perkataan #, atau dua simbol batasan perkataan atau lebih pada hujung yang sama.

source: There was a problem opening the current version of the file {0}, dated {1}. Would you like to open the automatic backup, {2}, dated {3}?
ms: Terdapat masalah membuka versi semasa fail {0}, yang bertarikh {1}. Mahukah anda membuka backup automatik, {2}, yang bertarikh {3}?

source: There was a problem while trying to restore the settings. Your settings will be restored to their default values.
ms: Terdapat masalah semasa cuba mengembalikan semula tetapan. Tetapan anda akan dikembalikan semula ke nilai asalnya.

source: There was an error processing that click or keypress
ms: Terdapat ralat memproses klik atau tekan kekunci

source: There was an error trying to create a subfolder of the new project. The error was: {0}
ms: Terdapat ralat cuba membuat subfolder projek baru. Ralatnya ialah: {0}

source: There was an error when creating the backup file for project: {0}. The error was: {1}
ms: Terdapat ralat semasa membuat fail backup bagi projek: {0}. Ralatnya ialah: {1}

source: There was an error while reading in the XML file: {0}.
ms: Terdapat ralat semasa membaca dalam fail XML: {0}

source: There was an error: {0} {1}
ms: Terdapat ralat: {0} {1}

source: These are the languages used for translations, texts, lexical headwords, example sentences, people, location names, etc. Select, or define, a default vernacular language writing system.
ms: Bahasa-bahasa ini digunakan untuk terjemahan, teks, leksikal kata utama, ayat-ayat contoh, nama orang, nama lokasi, dll. Pilih atau tentukan sistem penulisan bahasa vernakular asal.

source: These localizations are not all complete and are not necessarily thoroughly reviewed. If you have feedback, please send it to FLEx_Localization@sil.org.
ms: Lokalisasi-lokalisasi ini tidak semuanya lengkap dan tidak semestinya telah ditinjau secara menyeluruh. Jika anda mempunyai maklumbalas, sila kirimkan ke FLEx_Localization@sil.org.

source: {0} Third capture
ms: Penangkapan ketiga {0}

source: This dialog helps you create a new FieldWorks project, into which you can then enter data using FieldWorks applications.
ms: Dialog ini membantu anda membuat projek FieldWorks baru, yang ke dalamnya anda boleh masukkan data dengan menggunakan aplikasi FieldWorks nanti.

source: This discourse analysis tool has columns preset for SVO languages. If you need to change that order, edit the list called "Text Constituent Chart Templates". The columns are the 3rd level list items. If you change the columns after you have done some charting, you may need to rework your earlier charts. This tool does not yet support right-to-left writing systems.
ms: Alat analisis wacana ini mempunyai kolum-kolum yang ditata lebih dahulu untuk bahasa SVO. Jika anda perlu mengubah susunan tersebut, edit senarai yang bernama "Templat Carta Konstituen Teks". Kolum-kolum ini adalah butir senarai tahap ke-3. Jika anda mengubah kolum-kolum tersebut selepas anda telah siap membuat beberapa pencartaan, anda mungkin perlu kerjakan semula carta-carta terdahulu anda. Alat ini belum lagi dapat menampung sistem penulisan kanan-ke-kiri.

source: This is the date on which this item was first created.
ms: Ini adalah tarikh butir ini mula-mula dibuat.

source: This is the date on which this item was last modified.
ms: Ini adalah tarikh butir ini terakhir sekali diubahsuai.

source: This is the label or "category" this affix had when the lexical item was imported from some other lexicon (such as ShoeBox or ToolBox or LinguaLinks).
ms: Ini adalah label atau "kategori" yang diberikan kepada imbuhan ini apabila butir leksikon diimport dari beberapa leksikon lain (seperti ShoeBox atau ToolBox atau LinguaLinks).

source: This item is required by the program, so it can't be deleted.
ms: Butiran ini diperlukan oleh program, jadi ia tidak boleh dihapuskan.

source: This Lexeme Form contains several morphemes. Add the fields for me to specify the components and type of complex form.
ms: Bentuk Leksem ini mengandungi beberapa morfem. Tambah medan bagi saya untuk menentukan komponen-komponen dan jenis bentuk kompleks.

source: This Lexeme Form is also another kind of variant. Add the fields for me to specify the related form(s) and the variant type(s).
ms: Bentuk Leksem ini juga merupakan jenis varian yang lain. Tambah medan bagi saya untuk menentukan bentuk(-bentuk) dan jenis(-jenis) varian yang berkaitan.

source: This Lexeme Form is related to another form as a variant. Add the fields for me to specify the related form(s) and type of variant.
ms: Bentuk Leksem ini adalah berkaitan dengan bentuk lain sebagai suatu varian. Tambah medan bagi saya untuk menentukan bentuk(-bentuk) dan jenis varian yang berkaitan.

source: This &list contains data in:
ms: &Senarai ini mengandungi data di dalam:

source: This must always be the last value to indicate the limit for regular expression errors.
ms: Ini perlu sentiasa menjadi nilai yang terakhir untuk menunjukkan had bagi ralat ungkapan biasa.

source: This pane and the associated buttons allow you to search for and substitute (or delete) text.
ms: Anak tetingkap dan butang-butang yang berhubungan membenarkan anda untuk mencari dan menggantikan (atau menghapus) teks.

source: This pane lists all unique occurrences of the selected field in the Standard Format database file.
ms: Anak tetingkap ini menyenaraikan semua kemunculan unik bidang yang dipilih dalam fail pangkalan data Format Standard.

source: This pane lists the current set of date formats found in this field. (Usually only one format is needed, but sometimes more are necessary.)
ms: Anak tetingkap ini menyenaraikan set format tarikh semasa yang terdapat dalam bidang ini. (Biasanya hanya satu format sahaja yang diperlukan, tetapi kadang-kadang memerlukan lebih banyak.)

source: This part of a chart template cannot be moved or deleted, because it or one of its children is in use in one or more charts (e.g., {0}).
ms: Bahagian templat carta ini tidak dapat dipindah atau dihapus, kerana ia atau salah satu anak-anaknya sedang dalam penggunaan di dalam satu carta atau lebih. (contoh, {0}).

source: This procedure will guide you through the process of importing Standard Format data into the Notebook of the current FieldWorks Project.
ms: Tatacara ini akan membimbing anda melalui proses mengimport data Format Standard ke dalam Buku Nota Projek FieldWorks semasa.

source: This procedure will help you supply the settings needed to be able to import your standard format lexical data.
ms: Prosedur ini akan membantu anda membekalkan tetapan-tetapan yang diperlukan untuk dapat mengimport data leksikal format standard anda.

source: This process will take a long time. Do you want to continue?
ms: Proses ini akan mengambil masa yang lama. Adakah anda mahu teruskan?

source: This process will take a long time.{0}{0} Do you want to continue?
ms: Proses ini akan mengambil masa yang lama.{0}{0} Adakah anda mahu teruskan?

source: This processor uses a transducer unknown to this version of ICU. The first transducer will be substituted.
ms: Pemproses ini menggunakan satu transduser yang tidak diketahui oleh versi ICU ini. Transduser pertama akan digunakan sebagai ganti.

source: This project is for a newer version of FieldWorks. To open this project, click Close, and then install the newer version of FieldWorks. To revert to a version of this project which is compatible with this version of FieldWorks, click Restore a Project.
ms: Projek ini adalah untuk versi FieldWorks yang lebih terkini. Untuk membuka projek ini, klik Tutup, kemudian pasang versi FieldWorks yang lebih terkini. Untuk balik semula ke versi projek ini yang mana serasi dengan versi FieldWorks ini, klik Kembalikan Semula Projek.

source: This project is simultaneously being opened by another user. The project will be available to you shortly.
ms: Projek ini sedang dibuka pada masa yang sama oleh pengguna lain. Projek ini akan sedia diguna oleh anda sebentar lagi.

source: This project links to {0} external file(s) in the previous Linked Files folder. Would you like to move or copy the file(s) to the new folder to make it easier to share and back up, along with your other project data?
ms: Projek ini terpaut ke fail(-fail) luaran {0} dalam folder Fail Terpaut sebelumnya. Mahukah anda memindahkan atau menyalin fail(-fail) tersebut ke folder baru untuk memudahkannya dikongsikan dan diback up, bersama-sama dengan data projek anda?

source: This project links to {0} external files in the previous Linked Files folder. Would you like to move or copy the files to the new folder to make it easier to share and back up, along with your other project data?
ms: Projek ini terpaut ke {0} fail luaran dalam folder Fail Terpaut sebelumnya. Mahukah anda memindahkan atau menyalin fail tersebut ke folder baru untuk memudahkannya dikongsikan dan diback up, bersama-sama dengan data projek lain anda?

source: This restore operation will replace the existing project: {0}
ms: Proses mengembalikan semula akan menggantikan projek yang sedia ada: {0}

source: This tool is designed for a typist to use during a semantically-based word-collection workshop. For information on this method, see http://www.sil.org/computing/ddp/.
ms: Alat ini direkabentuk untuk digunakan oleh jurutaip semasa bengkel pengumpulan perkataan berdasar semantik. Untuk maklumat kaedah ini, lihat http://www.sil.org/computing/ddp/.

source: This utility attempts to fix various errors in a FieldWorks project file. The project must not be open, and must be in the fwdata (XML) format.
ms: Utiliti ini cuba membaiki pelbagai ralat dalam fail projek FieldWorks. Projek itu mestilah dibuka, dan mestilah dalam format fwdata (XML).

source: This utility cleans up the homographs numbers of lexical entries. It preserves the current relative order of homographs, so you won't lose any ordering you have done.
ms: Utiliti ini membersihkan nombor-nombor homograf entri-entri leksikal. Ia mengekalkan susunan relatif homograf-homograf semasa, jadi anda tidak akan kehilangan sebarang penyusunan yang telah anda buat.

source: This utility removes all parser approved analyses from the system. It does not remove analyses that are approved/disapproved of by a human being, however.
ms: Utiliti ini menanggalkan semua analisis yang diterima oleh penghurai kata dari sistem tersebut. Namun, ia tidak menanggalkan analisis yang diterima/tidak diterima oleh manusia.

source: This view shows semantic domains that have been used to classify senses, each listing the related senses. You can optionally show all semantic domains, even those that have not been used for any senses.
ms: Paparan ini menunjukkan domain-domain semantik yang telah digunakan untuk mengkelaskan makna, setiapnya menyenaraikan makna-makna yang berkaitan. Anda juga boleh secara pilihan menunjukkan semua domain semantik, malahan juga domain-domain semantik yang belum pernah digunakan oleh mana-mana makna.

source: This will delete {0} rows of data from your chart! Are you sure?
ms: Ini akan menghapus baris {0} data dari carta anda! Adakah anda pasti?

source: This will delete ALL the selected items and can sometimes take a long time. This action will not be undo-able. Do you want to proceed?
ms: Ini akan menghapus SEMUA butiran terpilih dan kadang-kadang boleh mengambil masa yang lama. Proses ini tidak akan dapat dibuat asal. Adakah anda mahu teruskan?

source: This will delete ALL the selected items. Do you want to proceed?
ms: Ini akan menghapus SEMUA butiran terpilih. Adakah anda mahu teruskan?

source: This writing system for {0} is for:
ms: Sistem penulisan untuk {0} adalah untuk:

source: Throw away everything not already in the list.
ms: Buang semua yang belum lagi berada dalam senarai.

source: Time Of Day
ms: Masa Hari

source: Time of Event
ms: Masa Peristiwa

source: Time of Event:
ms: Masa Peristiwa:

source: Title
ms: Tajuk

source: To Category
ms: Ke Kategori

source: To create a circumfix, every non-blank alternative of the Lexeme Form must have two morphemes separated by a space or period(s).
ms: Untuk membuat pembaikan lilit, setiap pilihan yang tidak kosong daripada bentuk leksem tersebut mestilah mempunyai dua morfem yang dipisahkan oleh satu jarak atau tempoh(-tempoh).

source: To edit the template table: right-click on STEM, on a slot name, or on a morpheme.
ms: Untuk mengedit jadual templat: klik-kanan pada DASAR, pada nama slot, atau pada morfem.

source: To Exception "Features"
ms: Ke Pengecualian "Ciri-Ciri"

source: To Inflection Class
ms: Ke Jenis Infleksi

source: To Inflection Features
ms: Ke Ciri-ciri Infleksi

source: To specify a Concordance, select a line in which to search and enter the text to search for.
ms: Untuk menentukan Konkordans, pilih baris sasaran dan masukkan teks untuk dicari.

source: Tone
ms: Nada

source: Tones
ms: Nada-nada

source: &Tools
ms: &Alat

source: _Tools
ms: _Alat

source: Tools
ms: Alat

source: &Top
ms: &Atas

source: Top
ms: Atas

source: Total Markers: XXX
ms: Jumlah Penanda: XXX

source: Trailing Token
ms: Token Penjejakan

source: _Translated List Content
ms: _Kandungan Senarai Yang Telah Diterjemahkan

source: Translated Lists Files
ms: Fail Senarai yang Diterjemahkan

source: Translation
ms: Terjemahan

source: Translation Type
ms: Jenis Terjemahan

source: Translation Types
ms: Jenis Terjemahan

source: Translations
ms: Terjemahan-terjemahan

source: Treat as not word forming
ms: Perlakukan sebagai bukan pembentukan perkataan

source: &Treat as not Word Forming
ms: &Perlakukan sebagai bukan Pembentukan Kata

source: &Treat as Punctuation
ms: &Perlakukan sebagai Tanda Bacaan

source: &Treat as Symbol
ms: &Perlakukan sebagai Simbol

source: Treat as word forming
ms: Perlakukan sebagai pembentukan kata

source: &Treat as Word-Forming
ms: &Perlakukan sebagai Pembentukan Kata

source: Try a Word
ms: Cuba sepatah Perkataan

source: _Try a Word...
ms: _Cuba Sepatah Perkataan...

source: &Try it
ms: &Cuba

source: Trying Wordform {0}
ms: Mencuba Bentuk kata {0}

source: Turn off all filters
ms: Matikan semua penapis

source: Turn off all filters.
ms: Matikan semua penapis.

source: _Type
ms: _Jenis

source: Type
ms: Jenis

source: Type a space to separate morphemes and a break character to indicate the morpheme type.
ms: Taip jarak untuk memisahkan morfem-morfem dan aksara uraian untuk menandakan jenis morfem

source: Type slot name here
ms: Taip nama slot di sini

source: Type:
ms: Jenis:

source: Unable to access the project data folder: {0} Ensure that this folder is shared and that you have permission to access it.
ms: Tidak dapat mengakses folder data projek: {0} Pastikan bahawa folder in dikongsikan dan bahawa anda mempunyai kebenaran untuk mengaksesnya.

source: Unable to Create Backup Folder
ms: Tidak dapat Membuat Folder Backup

source: Unable to initialize the data.
ms: Tidak dapat memulakan data.

source: Unable to Insert Movie File
ms: Tidak Dapat Menyelitkan Fail Wayang Gambar

source: Unable to Insert Picture
ms: Tidak Dapat Menyelitkan Gambar

source: Unable to Insert Sound File
ms: Tidak Dapat Menyelitkan Fail Bunyi

source: Unable to modify project locations.
ms: Tidak dapat mengubahsuai lokasi projek.

source: Unable to Open Project
ms: Tidak dapat Membuka Projek

source: Unable to restore project from this backup file, which was created with an earlier version of FieldWorks:
ms: Tidak dapat mengembalikan semula projek dari fail backup ini, yang dibuat dengan versi FieldWorks yang sebelumnya:

source: Unable to restore.
ms: Tidak dapat mengembalikan semula.

source: Unable to start {0}.
ms: Tidak dapat mula {0}.

source: Unable to Update {0} on {1} from version {2} to {3}.{4}You need to update the database on the local machine.
ms: Tidak dapat Mengemaskini {0} pada {1} dari versi {2} ke {3}.{4}Anda perlu mengemaskini pangkalan data pada komputer tempatan.

source: Uncheck all
ms: Hapus semua tanda

source: Unclassified affix
ms: Imbuhan yang tidak dikelaskan

source: Undecided
ms: Belum Diputuskan

source: {0} Underline
ms: {0} Garis Bawah

source: Under&line color:
ms: Warna garis &bawah:

source: &Underline style:
ms: &Garis bawah:

source: &Undo
ms: &Buat Asal

source: _Undo
ms: _Buat Asal

source: Undo
ms: Buat Asal

source: &Undo {0}
ms: &Buat Asal {0}

source: Undo {0}
ms: Buat Asal {0}

source: Undo {0} actions
ms: Buat Asal {0} tindakan

source: Undo {0} Actions
ms: Buat Asal {0} Tindakan

source: Undo 1 Action
ms: Buat Asal 1 Tindakan

source: Undo Add Component
ms: Buat Asal Tambah Komponen

source: Undo Add Reversal Entry to Sense
ms: Buat Asal Menambahkan Entri Pembalikan ke Makna

source: Undo Bulk Edit Reversal Entry POS
ms: Buat Asal Edit Banyak Jenis Kata Entri Pembalikan

source: Undo Change Morpheme Type
ms: Buat Asal Mengubah Jenis Morfem

source: Undo changing {0} to {1}
ms: Buat Asal mengubah {0} ke {1}

source: Undo Create Reversal Index
ms: Buat Asal Membuat Indek Pembalikan

source: Undo Create Variant Entry
ms: Buat Asal Membuat Entri Varian

source: Undo Creating Inflectional Affix Category Item
ms: Buat Asal Membuat Butir Kategori Imbuhan Infleksi

source: Undo Insert Invisible Space
ms: Buat Asal Selit Jarak Halimunan

source: Undo Make Reversal Entries
ms: Buat Asal Membuat Entri Pembalikan

source: Undo Merge Reversal Category
ms: Buat Asal Mencantumkan Kategori Pembalikan

source: Undo Move Reversal Category
ms: Buat Asal Pindahkan Kategori Pembalikan

source: Undo Set Phonological Features
ms: Buat Asal Khaskan Ciri Fonologi

source: Undo Set Reversal Entries
ms: Buat Asal Khaskan Entri Pembalikan

source: Undo Spelling Change
ms: Buat Asal Perubahan Ejaan

source: Undo Variant Of
ms: Buat Asal Varian Dari

source: Undo Visible Complex Form
ms: Buat Asal Bentuk Kompleks Kelihatan

source: Unicode Page
ms: Halaman Unikod

source: Unicode to and from Legacy
ms: Unikod ke dan dari Legasi

source: Unicode to and from Unicode
ms: Unikod ke dan dari Unikod

source: Unicode to Legacy
ms: Unikod ke Legacy

source: Unicode to Unicode
ms: Unikod ke Unikod

source: Unicode Value
ms: Nilai Unikod

source: Unknown
ms: Tidak Diketahui

source: unknown category
ms: kategori yang tidak diketahui

source: <Unknown Complex Form>
ms: <Bentuk Kompleks yang Tidak Diketahui>

source: unknown morph type
ms: jenis morfem yang tidak diketahui
